app/controllers/users_controller.rb

  def create
#     accept normal top level User attributes
    @user = User.new(:username => params[:username],
    :email => params[:email], :password => params[:password])
      if @user.save
---
INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "bee"], ["email", "brd23@gmail.com"], ["password", "ddddd"], ["created_at", "2015-01-26 07:06:47.935175"], ["updated_at", "2015-01-26 07:06:47.935175"]]